{
  "generatedAt": "2026-01-21T16:11:00.939Z",
  "sources": [
    {
      "id": "ours-website-news",
      "company": "Swiis Foster Care",
      "companyGroup": "ours",
      "type": "website",
      "title": "Swiis Foster Care News",
      "pageUrl": "https://www.swiisfostercare.com/info-hub/",
      "rssUrl": "https://www.swiisfostercare.com/feed/",
      "warning": null
    },
    {
      "id": "ours-facebook",
      "company": "Swiis Foster Care",
      "companyGroup": "ours",
      "type": "facebook",
      "title": "Swiis Foster Care Facebook",
      "pageUrl": "https://www.facebook.com/swiisfostercare",
      "rssUrl": "",
      "warning": "No rssUrl configured (link-only source)."
    },
    {
      "id": "competitor1-news",
      "company": "Compass Fostering",
      "companyGroup": "competitor",
      "type": "website",
      "title": "Compass Fostering News",
      "pageUrl": "https://www.compassfostering.com/news/",
      "rssUrl": "https://www.compassfostering.com/news/rss",
      "warning": "Failed to fetch/parse feed: Status code 500"
    },
    {
      "id": "competitor1-blogs",
      "company": "Compass Fostering",
      "companyGroup": "competitor",
      "type": "website",
      "title": "Compass Fostering Blogs",
      "pageUrl": "https://www.compassfostering.com/blogs/",
      "rssUrl": "https://www.compassfostering.com/blogs/rss",
      "warning": "Failed to fetch/parse feed: Status code 500"
    },
    {
      "id": "competitor1-facebook",
      "company": "Compass Fostering",
      "companyGroup": "competitor",
      "type": "facebook",
      "title": "Compass Fostering Facebook",
      "pageUrl": "https://www.facebook.com/CompassFostering/",
      "rssUrl": "",
      "warning": "No rssUrl configured (link-only source)."
    }
  ],
  "items": [
    {
      "id": "ours-website-news:d579ffb9",
      "sourceId": "ours-website-news",
      "sourceTitle": "Swiis Foster Care News",
      "company": "Swiis Foster Care",
      "companyGroup": "ours",
      "type": "website",
      "pageUrl": "https://www.swiisfostercare.com/info-hub/",
      "title": "Celebrating a full house of Ofsted ‘Outstanding’ Reports",
      "link": "https://www.swiisfostercare.com/celebrating-a-full-house-of-ofsted-outstanding-reports/",
      "isoDate": "2026-01-19T09:00:00.000Z",
      "snippet": "Following Ofsted inspections across the Midlands and South, North East and North West and with Yorkshire already holding an ‘Ofsted Outstanding’ accreditation, every one of our offices have once again been awarded the highest possible rating of ‘Outstanding’ across all areas of our service. The post Celebrating a full house of Ofsted ‘Outstanding’ Reports appeared first on Swiis Foster Care.",
      "content": "<p>2025 has been a truly exceptional year for Swiis Foster Care. Following Ofsted inspections across the Midlands and South, North East and North West and with Yorkshire already holding an ‘Ofsted Outstanding’ accreditation, every one of our offices have once again been awarded the highest possible rating of ‘Outstanding’ across all areas of our service.</p>\n\n\n\n<p>Consistently achieving Ofsted’s highest rating is an exceptional accomplishment within the fostering sector, attained by only a small number of agencies nationwide. Through sustained excellence and unwavering commitment to children and young people, Swiis stands among a select and respected small group of UK fostering providers currently holding multiple <em>‘Outstanding’</em> ratings simultaneously.</p>\n\n\n<div class=\"kb-row-layout-wrap kb-row-layout-id27548_245790-bb alignnone wp-block-kadence-rowlayout\"><div class=\"kt-row-column-wrap kt-has-2-columns kt-row-layout-left-golden kt-tab-layout-inherit kt-mobile-layout-row kt-row-valign-top\">\n\n<div class=\"wp-block-kadence-column kadence-column27548_a70273-cd\"><div class=\"kt-inside-inner-col\">\n<p>Ofsted’s inspection report celebrates not only the quality of provision but the life-changing impact of Swiis’s work, noting:</p>\n\n\n\n<p><em>“(Swiis), the independent fostering agency provides highly effective services that consistently exceed the standards of good. The actions of the independent fostering agency contribute to significantly improved outcomes and positive experiences for children and young people.”</em></p>\n</div></div>\n\n\n\n<div class=\"wp-block-kadence-column kadence-column27548_920b70-65\"><div class=\"kt-inside-inner-col\">\n<div class=\"wp-block-kadence-image kb-image27548_4eacdd-58\"><figure class=\"aligncenter size-full\"><img fetchpriority=\"high\" decoding=\"async\" width=\"638\" height=\"639\" src=\"https://www.swiisfostercare.com/wp-content/uploads/2024/06/Ofsted_Outstanding.png\" alt=\"Ofsted - Outstanding provider\" class=\"kb-img wp-image-23878\" srcset=\"https://www.swiisfostercare.com/wp-content/uploads/2024/06/Ofsted_Outstanding.png 638w, https://www.swiisfostercare.com/wp-content/uploads/2024/06/Ofsted_Outstanding-150x150.png 150w\" sizes=\"(max-width: 638px) 100vw, 638px\" /></figure></div>\n</div></div>\n\n</div></div>\n\n\n<h2 class=\"wp-block-heading\">What Does Being an Ofsted ‘Outstanding’ Fostering Agency Mean?</h2>\n\n\n\n<p>Being rated ‘Outstanding’ by Ofsted is more than an impressive achievement. It is a clear indication that children and young people experience the highest quality care and support possible, enabling them to achieve their goals and ambitions that they may not have been able to. It reflects consistently excellent practice, robust safeguarding, and exceptional leadership across every part of our agency.</p>\n\n\n\n<h3 class=\"wp-block-heading\">For the Children and Young People in Our Care</h3>\n\n\n\n<p>For children, this means they feel safe, valued, and genuinely heard by our foster carers and staff. They are supported to grow in confidence, achieve their goals, and experience the stability and encouragement they need to thrive. It shows that their voices matter and that their wellbeing is at the heart of everything we do.</p>\n\n\n\n<h3 class=\"wp-block-heading\">For Our Foster Carers</h3>\n\n\n\n<p>For foster carers, this recognition reflects the high-quality training, guidance and round-the-clock support they receive, as well as the positive, lasting difference they make to the lives of the children in their care. Swiis foster carers are among the best in the sector, consistently providing nurturing, stable homes where children and young people feel safe, valued and able to thrive.</p>\n\n\n\n<p>Swiis foster carers know they are never alone. They are part of a supportive community, backed by a dedicated team who are always there, listening, guiding and standing alongside them, fully committed to their success and to the wellbeing and future of every child and young person in their care.</p>\n\n\n\n<h3 class=\"wp-block-heading\">As a Fostering Agency</h3>\n\n\n\n<p>Ofsted only awards ‘Outstanding’ when a fostering agency consistently goes above and beyond for their foster carers and the children within their care. Having consistently ‘Outstanding’ ratings in all areas across our Midlands and South, North East, Yorkshire and North West offices is an exceptionally proud achievement for all Swiis staff.</p>\n\n\n\n<p>This accomplishment reflects the dedication, compassion and professionalism of every member of the Swiis team. It is a testament to the hard work our staff put in every day and to our unwavering commitment to achieving the best possible outcomes for children and young people.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Highlights From Our Ofsted Reports</h2>\n\n\n\n<p>Across the Midlands and South, North East, Yorkshire and North West, children receive nurturing, individualised care that helps them make exceptional progress. Many enjoy long-term, stable home arrangements, building trusting and meaningful relationships with their foster carers.</p>\n\n\n\n<p>Below, we have shared just a small selection of the wonderful feedback highlighted by Ofsted. If you would like to explore our reports in full, you can find them on the Government website here:</p>\n\n\n\n<div class=\"wp-block-kadence-advancedbtn kb-buttons-wrap kb-btns27548_055048-9a\"><a class=\"kb-button kt-button button kb-btn27548_147c00-a0 kt-btn-size-standard kt-btn-width-type-auto kb-btn-global-fill  kt-btn-has-text-true kt-btn-has-svg-false  wp-block-kadence-singlebtn\" href=\"https://files.ofsted.gov.uk/v1/file/50272914\"><span class=\"kt-btn-inner-text\">North East Ofsted Report</span></a>\n\n<a class=\"kb-button kt-button button kb-btn27548_e62f14-1d kt-btn-size-standard kt-btn-width-type-auto kb-btn-global-fill  kt-btn-has-text-true kt-btn-has-svg-false  wp-block-kadence-singlebtn\" href=\"https://files.ofsted.gov.uk/v1/file/50292707\"><span class=\"kt-btn-inner-text\">North West Ofsted Report</span></a>\n\n<a class=\"kb-button kt-button button kb-btn27548_e9ccc5-53 kt-btn-size-standard kt-btn-width-type-auto kb-btn-global-fill  kt-btn-has-text-true kt-btn-has-svg-false  wp-block-kadence-singlebtn\" href=\"https://files.ofsted.gov.uk/v1/file/50272692\"><span class=\"kt-btn-inner-text\">Midlands &amp; South Ofsted Report</span></a>\n\n<a class=\"kb-button kt-button button kb-btn27548_13f2a7-1a kt-btn-size-standard kt-btn-width-type-auto kb-btn-global-fill  kt-btn-has-text-true kt-btn-has-svg-false  wp-block-kadence-singlebtn\" href=\"https://files.ofsted.gov.uk/v1/file/50190369\"><span class=\"kt-btn-inner-text\">Yorkshire Ofsted Report</span></a></div>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Support for Children and Young People’s Educational Needs</strong></h3>\n\n\n\n<p>Education is a key strength, with children attending school regularly, consistently achieving above expectations, and benefiting from specialist support tailored to their individual learning needs. Swiis places strong emphasis on children’s engagement with education, ensuring their commitment and participation are actively supported. Every achievement, big or small, is recognised and celebrated by our teams, helping children build confidence and feel empowered to aspire to and reach their goals.</p>\n\n\n\n<p><em>“Specialist and bespoke support is provided by a dedicated team that works alongside children to break down any barriers to their learning.”</em> &#8211; Midlands and South Ofsted Report</p>\n\n\n\n<p><em>“Children’s education and learning progress are at the forefront of the agency’s practice.”</em> &#8211; North East Ofsted Report</p>\n\n\n\n<p>Swiis <a href=\"https://www.swiisfostercare.com/fostering/support/\">Education Advisors</a> work closely with children and foster carers to understand each child’s unique learning needs and provide tailored guidance to overcome challenges. By prioritising education, Swiis ensures that every child and young person has the best possible opportunity to succeed, develop confidence, and achieve their full potential, while foster carers feel fully supported in helping children reach their goals.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Our Dedicated Stability and Support Team</strong></h3>\n\n\n\n<p>Swiis’s Stability &amp; Support Team provides foster carers with an additional layer of personalised guidance and one-to-one support, helping them respond confidently to any concerns or behaviours a child or young person may present. From the very beginning of their fostering journey, carers can access practical advice and proven strategies to support them through any challenging moments.&nbsp; The Stability and Support Team can be accessed directly by the foster carer if preferred and is in addition to the exceptional daily support of the social work teams.&nbsp; This wrap around support ensures foster carers are well equipped to create safe, nurturing environments where children can thrive, grow and overcome barriers they may face.</p>\n\n\n\n<p><em>“Foster carers feel exceptionally well supported and valued by agency staff, which impacts positively on the outcomes of children who are thriving in their foster families.”</em> &#8211; North West Ofsted Report</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Exceptional Safeguarding</strong></h3>\n\n\n\n<p>Safeguarding is at the heart of everything we do at Swiis. Children and young people feel safe, supported and valued in our foster homes, cared for by experienced foster carers and supported by highly skilled and committed social work teams. We operate robust and comprehensive safeguarding processes to ensure the highest standards of safety and wellbeing for every child in our care.</p>\n\n\n\n<p>Safeguarding is also central to our recruitment, assessment and approval processes. All foster carers and Swiis staff go through rigorous checks and preparation, ensuring they are well trained, confident and fully supported in their role. This strong safeguarding framework promotes stability and enables foster carers to provide safe, nurturing homes where children can thrive.</p>\n\n\n\n<p><em>“Safeguarding children is at the centre of the agency.”</em> &#8211; Midlands and South Ofsted Report</p>\n\n\n\n<p>At Swiis, every decision and action prioritises the safety and well-being of children. This gives foster carers confidence that they are fully supported when protecting children, knowing they are not alone in ensuring the highest standards of care. Children, in turn, feel secure, protected, and able to build trust with the foster carers caring for them.</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Comprehensive and Relevant Training</strong></h3>\n\n\n\n<p>Swiis provides foster carers with comprehensive and practical <a href=\"https://www.swiisfostercare.com/fostering/training/\">training</a>, giving them the knowledge and confidence they need to meet children’s diverse needs. Well-trained foster carers can respond effectively to both every day and complex situations, helping children feel secure, supported, and understood at all times.</p>\n\n\n\n<p><em>“Highly effective post-approval training ensures that foster carers have the relevant skills and knowledge to undertake the fostering role.”</em> &#8211; North West Ofsted Report</p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Child-Focused Leadership and Staff</strong></h3>\n\n\n\n<p>Swiis is led by experienced leaders who provide strong oversight and inspire continuous improvement. Staff morale is high, workloads are manageable, and teams work closely together to deliver consistent, high-quality care. All regions have strong partnerships with other professionals to ensure children remain at the centre of all practice.</p>\n\n\n\n<p><em>“Foster carers have provided overwhelmingly positive feedback about the support they receive from the agency.”</em> &#8211; Midlands and South Ofsted Report</p>\n\n\n\n<p>Foster carers consistently report feeling valued, supported, and heard. This strengthens fostering home-finding arrangements, enabling children to thrive in stable, nurturing homes where their emotional and developmental needs are met.</p>\n\n\n\n<p><em>“Staff morale is high, and staff say that they love their job.”</em> &#8211; North East Ofsted Report</p>\n\n\n\n<p>Motivated and passionate staff ensure children receive consistent, high-quality care. When staff feel proud and inspired by their work, it directly benefits foster carers and children, creating a supportive environment where everyone can flourish.</p>\n\n\n\n<p><em>“Social workers have manageable caseloads and are in weekly contact with their foster carers.”</em> &#8211; North West Ofsted Report</p>\n\n\n\n<p>Regular, meaningful contact allows social workers to provide timely guidance, reassurance, and practical support. This ensures foster carers are equipped to meet children’s needs effectively, helping children feel safe, cared for, and supported at every stage of their fostering journey.</p>\n\n\n\n<figure class=\"wp-block-kadence-image kb-image27548_bc74df-1d size-full\"><img decoding=\"async\" width=\"1920\" height=\"1280\" src=\"https://www.swiisfostercare.com/wp-content/uploads/2026/01/Ofsted-Blog-North-West-Team.jpg\" alt=\"North West Team\" class=\"kb-img wp-image-27550\" srcset=\"https://www.swiisfostercare.com/wp-content/uploads/2026/01/Ofsted-Blog-North-West-Team.jpg 1920w, https://www.swiisfostercare.com/wp-content/uploads/2026/01/Ofsted-Blog-North-West-Team-768x512.jpg 768w, https://www.swiisfostercare.com/wp-content/uploads/2026/01/Ofsted-Blog-North-West-Team-1536x1024.jpg 1536w\" sizes=\"(max-width: 1920px) 100vw, 1920px\" /></figure>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>A Huge Thank You!</strong></h2>\n\n\n\n<p>We would like to extend our heartfelt thanks to our foster carers, the children, and young people in our care, and every member of the Swiis team. Your dedication, commitment, and collaboration are at the heart of these ‘Outstanding’ achievements. These Ofsted results celebrate the care, passion, and teamwork that make Swiis a truly exceptional fostering service.</p>\n<p>The post <a href=\"https://www.swiisfostercare.com/celebrating-a-full-house-of-ofsted-outstanding-reports/\">Celebrating a full house of Ofsted  ‘Outstanding’ Reports</a> appeared first on <a href=\"https://www.swiisfostercare.com\">Swiis Foster Care</a>.</p>",
      "images": [
        "https://www.swiisfostercare.com/wp-content/uploads/2026/01/Ofsted-Blog-Durham-Team.jpg"
      ]
    },
    {
      "id": "ours-website-news:a7b81ce5",
      "sourceId": "ours-website-news",
      "sourceTitle": "Swiis Foster Care News",
      "company": "Swiis Foster Care",
      "companyGroup": "ours",
      "type": "website",
      "pageUrl": "https://www.swiisfostercare.com/info-hub/",
      "title": "Swiis Foster Care: Highlights of an Extraordinary 2025",
      "link": "https://www.swiisfostercare.com/swiis-foster-care-highlights-of-an-extraordinary-2025/",
      "isoDate": "2026-01-15T16:54:13.000Z",
      "snippet": "2025 has been a year where children have thrived, foster carers have felt truly supported, and our teams have gone above and beyond to deliver life-changing care. The post Swiis Foster Care: Highlights of an Extraordinary 2025 appeared first on Swiis Foster Care.",
      "content": "<p>2025 has been a truly remarkable year for Swiis Foster Care, a year defined by commitment, compassion, and collective excellence. Above all else, it has been a year where children have thrived, foster carers have felt truly supported, and our teams have gone above and beyond to deliver life-changing care.</p>\n\n\n\n<h2 class=\"wp-block-heading\">A Landmark Year: Ofsted Outstanding – Three Times Over</h2>\n\n\n\n<p>The pinnacle of 2025 came in the latter part of the year, when Swiis Foster Care achieved an exceptional milestone: three Ofsted inspections, each awarded Outstanding across all areas. This achievement means that all Swiis regions, including Yorkshire, the North East, the North West, the Midlands and South, are officially rated Outstanding, the highest possible recognition across all areas of our service.</p>\n\n\n\n<p>These inspections were embraced by every team member as an opportunity to showcase the exceptional work we do together. An Ofsted Outstanding rating is more than an accolade, it is recognition that children are not only safe but flourishing, supported by stable arrangements, highly skilled foster carers, and leadership that is relentless in its pursuit of excellence.</p>\n\n\n\n<p>An outstanding award also reflects the fact that our foster carers are exceptionally well trained and supported, with robust safeguarding, strong professional relationships, and a culture of continuous improvement that truly puts children first.</p>\n\n\n<div class=\"kb-row-layout-wrap kb-row-layout-id27522_736d13-8b aligncenter wp-block-kadence-rowlayout\"><div class=\"kt-row-column-wrap kt-has-2-columns kt-row-layout-right-golden kt-tab-layout-right-golden kt-mobile-layout-row kt-row-valign-middle\">\n\n<div class=\"wp-block-kadence-column kadence-column27522_f7cf38-f4 kb-section-dir-vertical inner-column-2\"><div class=\"kt-inside-inner-col\">\n<div class=\"wp-block-kadence-image kb-image27522_0cb01e-bc\"><figure class=\"aligncenter size-full\"><img decoding=\"async\" width=\"638\" height=\"639\" src=\"https://www.swiisfostercare.com/wp-content/uploads/2024/06/Ofsted_Outstanding.png\" alt=\"Ofsted - Outstanding provider\" class=\"kb-img wp-image-23878\" srcset=\"https://www.swiisfostercare.com/wp-content/uploads/2024/06/Ofsted_Outstanding.png 638w, https://www.swiisfostercare.com/wp-content/uploads/2024/06/Ofsted_Outstanding-150x150.png 150w\" sizes=\"(max-width: 638px) 100vw, 638px\" /></figure></div>\n</div></div>\n\n\n\n<div class=\"wp-block-kadence-column kadence-column27522_190dd3-00 kb-section-dir-vertical inner-column-1\"><div class=\"kt-inside-inner-col\">\n<p class=\"has--font-size\"><em>&#8220;The independent fostering agency provides highly effective services that consistently exceed the standards of good. The actions of the independent fostering agency contribute to significantly improved outcomes and positive experiences for children and young people.&#8221;</em>  &#8211; <strong>Ofsted, 2025</strong></p>\n\n\n\n<div class=\"wp-block-kadence-advancedbtn kb-buttons-wrap kb-btns27522_ad181b-db\"><a class=\"kb-button kt-button button kb-btn27522_c5a148-fa kt-btn-size-small kt-btn-width-type-auto kb-btn-global-inherit  kt-btn-has-text-true kt-btn-has-svg-false  wp-block-button__link wp-block-kadence-singlebtn\" href=\"https://files.ofsted.gov.uk/v1/file/50272914\"><span class=\"kt-btn-inner-text\">North East Ofsted Report</span></a>\n\n<a class=\"kb-button kt-button button kb-btn27522_f23188-31 kt-btn-size-small kt-btn-width-type-auto kb-btn-global-inherit  kt-btn-has-text-true kt-btn-has-svg-false  wp-block-button__link wp-block-kadence-singlebtn\" href=\"https://files.ofsted.gov.uk/v1/file/50292707\"><span class=\"kt-btn-inner-text\">North West Ofsted Report</span></a>\n\n<a class=\"kb-button kt-button button kb-btn27522_ec234a-5c kt-btn-size-small kt-btn-width-type-auto kb-btn-global-inherit  kt-btn-has-text-true kt-btn-has-svg-false  wp-block-button__link wp-block-kadence-singlebtn\" href=\"https://files.ofsted.gov.uk/v1/file/50272692\"><span class=\"kt-btn-inner-text\">Midlands &amp; South Ofsted Report</span></a>\n\n<a class=\"kb-button kt-button button kb-btn27522_c1dbaf-8b kt-btn-size-small kt-btn-width-type-auto kb-btn-global-inherit  kt-btn-has-text-true kt-btn-has-svg-false  wp-block-button__link wp-block-kadence-singlebtn\" href=\"https://files.ofsted.gov.uk/v1/file/50190369\"><span class=\"kt-btn-inner-text\">Yorkshire Ofsted Report</span></a></div>\n</div></div>\n\n</div></div>\n\n\n<h2 class=\"wp-block-heading\">Children Thriving Through Stability and Belonging</h2>\n\n\n\n<p>At the heart of everything we do are our children, and this year, their achievements have been nothing short of inspiring. Across Swiis Foster Care, children have experienced increased stability, improved emotional well-being, and the confidence that comes from feeling safe, valued, and listened to.</p>\n\n\n\n<p>Many of our children have made significant personal progress, overcoming early trauma with the help of consistent, nurturing foster arrangements. These achievements, whether it’s improved school attendance, renewed self-belief, learning new skills or simply learning to trust again, are powerful reminders of the impact that exceptional foster care can have on a child’s life.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Foster Carers: The Beating Heart of Swiis Foster Care</h2>\n\n\n\n<p>In 2025, Swiis Foster Care truly demonstrated that we are the agency of choice. We recruited the highest number of foster carers in our history, far exceeding the average for fostering agencies nationally. This extraordinary achievement reflects the trust carers place in Swiis and the reputation we have built for outstanding support, training, and care.</p>\n\n\n\n<p>Our foster carers continue to show unwavering dedication, opening their hearts and homes to children who need them most. Their resilience, compassion, and commitment underpin every success we celebrate.</p>\n\n\n\n<figure class=\"wp-block-kadence-image kb-image27522_865ff4-bc size-full\"><img loading=\"lazy\" decoding=\"async\" width=\"1920\" height=\"1280\" src=\"https://www.swiisfostercare.com/wp-content/uploads/2025/03/swiis-every-parent-day-2025-SWIISDURHAM062-edited.jpg\" alt=\"Swiis Every Parent Day 2025\" class=\"kb-img wp-image-26802\" srcset=\"https://www.swiisfostercare.com/wp-content/uploads/2025/03/swiis-every-parent-day-2025-SWIISDURHAM062-edited.jpg 1920w, https://www.swiisfostercare.com/wp-content/uploads/2025/03/swiis-every-parent-day-2025-SWIISDURHAM062-edited-768x512.jpg 768w, https://www.swiisfostercare.com/wp-content/uploads/2025/03/swiis-every-parent-day-2025-SWIISDURHAM062-edited-1536x1024.jpg 1536w\" sizes=\"auto, (max-width: 1920px) 100vw, 1920px\" /></figure>\n\n\n\n<h2 class=\"wp-block-heading\">Support That Never Sleeps: 24/7, Every Day</h2>\n\n\n\n<p>At Swiis Foster Care, support doesn’t stop at office hours. Our foster carers have access to guidance and reassurance 24 hours a day, 7 days a week, ensuring that no concern, challenge, or unexpected situation is faced alone. This constant availability provides confidence, reassurance, and peace of mind, a cornerstone of our outstanding practice.<br></p>\n\n\n<div class=\"kb-row-layout-wrap kb-row-layout-id27522_409c21-6c alignfull has-theme-palette9-background-color kt-row-has-bg wp-block-kadence-rowlayout\"><div class=\"kt-row-column-wrap kt-has-1-columns kt-row-layout-equal kt-tab-layout-inherit kt-mobile-layout-row kt-row-valign-top kb-theme-content-width\">\n\n<div class=\"wp-block-kadence-column kadence-column27522_e99ae8-1e\"><div class=\"kt-inside-inner-col\"><div class=\"kb-row-layout-wrap kb-row-layout-id27522_ab8e17-93 alignnone wp-block-kadence-rowlayout\"><div class=\"kt-row-column-wrap kt-has-2-columns kt-row-layout-equal kt-tab-layout-inherit kt-mobile-layout-row kt-row-valign-top\">\n\n<div class=\"wp-block-kadence-column kadence-column27522_a7d099-1d\"><div class=\"kt-inside-inner-col\">\n<div class=\"wp-block-kadence-image kb-image27522_4af571-c8\"><figure class=\"aligncenter size-medium_large kb-image-is-ratio-size\"><div class=\"kb-is-ratio-image kb-image-ratio-square\"><img loading=\"lazy\" decoding=\"async\" width=\"768\" height=\"768\" src=\"https://www.swiisfostercare.com/wp-content/uploads/2025/01/rachel-foster-story-768x768.jpg\" alt=\"Rachel's fostering story\" class=\"kb-img wp-image-26461\" srcset=\"https://www.swiisfostercare.com/wp-content/uploads/2025/01/rachel-foster-story-768x768.jpg 768w, https://www.swiisfostercare.com/wp-content/uploads/2025/01/rachel-foster-story-150x150.jpg 150w, https://www.swiisfostercare.com/wp-content/uploads/2025/01/rachel-foster-story.jpg 1080w\" sizes=\"auto, (max-width: 768px) 100vw, 768px\" /></div></figure></div>\n\n\n\n<h3 class=\"wp-block-heading has-text-align-center\">Rachel&#8217;s Fostering Story</h3>\n\n\n\n<p class=\"has-text-align-center\"><em>“From the very beginning, Swiis has been an incredible support system. They have listened to me when discussing my choices and have always supported my decisions. I truly believe we work as a team, and I always feel listened to, and I plan to continue fostering with Swiis until I retire.”</em></p>\n\n\n\n<div class=\"wp-block-buttons is-content-justification-center is-layout-flex wp-container-core-buttons-is-layout-16018d1d wp-block-buttons-is-layout-flex\">\n<div class=\"wp-block-button\"><a class=\"wp-block-button__link wp-element-button\" href=\"https://www.swiisfostercare.com/story/rachels-fostering-story/\">Read Rachel&#8217;s Fostering Story</a></div>\n</div>\n</div></div>\n\n\n\n<div class=\"wp-block-kadence-column kadence-column27522_269d29-f0\"><div class=\"kt-inside-inner-col\">\n<div class=\"wp-block-kadence-image kb-image27522_e208bd-7d\"><figure class=\"aligncenter size-medium_large kb-image-is-ratio-size\"><div class=\"kb-is-ratio-image kb-image-ratio-square\"><img loading=\"lazy\" decoding=\"async\" width=\"768\" height=\"1152\" src=\"https://www.swiisfostercare.com/wp-content/uploads/2025/03/Swiis-Durham-Bianca-768x1152.jpg\" alt=\"Bianca, Swiis Durham\" class=\"kb-img wp-image-26799\" srcset=\"https://www.swiisfostercare.com/wp-content/uploads/2025/03/Swiis-Durham-Bianca-768x1152.jpg 768w, https://www.swiisfostercare.com/wp-content/uploads/2025/03/Swiis-Durham-Bianca-1024x1536.jpg 1024w, https://www.swiisfostercare.com/wp-content/uploads/2025/03/Swiis-Durham-Bianca-1365x2048.jpg 1365w, https://www.swiisfostercare.com/wp-content/uploads/2025/03/Swiis-Durham-Bianca-scaled.jpg 1707w\" sizes=\"auto, (max-width: 768px) 100vw, 768px\" /></div></figure></div>\n\n\n\n<h3 class=\"wp-block-heading has-text-align-center\">Bianca&#8217;s Fostering Story</h3>\n\n\n\n<p class=\"has-text-align-center\"><em>“Swiis Foster Care have supported us every step of the way. The assessment process and initial training were both realistic and supportive, and we have made positive relationships with all the Swiis staff. What makes Swiis different is that the teams are genuinely interested in carers and the children, and that makes a big difference.”</em></p>\n\n\n\n<div class=\"wp-block-buttons is-content-justification-center is-layout-flex wp-container-core-buttons-is-layout-16018d1d wp-block-buttons-is-layout-flex\">\n<div class=\"wp-block-button\"><a class=\"wp-block-button__link wp-element-button\" href=\"https://www.swiisfostercare.com/story/bianca-and-jermells-fostering-story/\">Read Bianca&#8217;s Fostering Story</a></div>\n</div>\n</div></div>\n\n</div></div></div></div>\n\n</div></div>\n\n\n<h2 class=\"wp-block-heading\">Going Beyond: The Stability and Support Team</h2>\n\n\n\n<p>A few years ago, Swiis Foster Care took an innovative step to further enhance support by developing a specialist Stability and Support Team. Their role is to work directly with foster carers, offering tailored advice, practical strategies, and specialist guidance around behaviours and complex needs.</p>\n\n\n\n<p>In 2025, this team had its busiest year yet. Demand grew as carers increasingly accessed this invaluable support, a clear testament to how impactful and trusted the service has become. In response, we expanded the team to ensure every foster carer receives timely, expert help when they need it most.</p>\n\n\n\n<p>The team also introduced specialist forum groups and topical webinar training, with subjects chosen by our foster carers themselves. This collaborative approach has empowered carers, strengthened peer connections, and further enhanced the quality of care provided to children.</p>\n\n\n\n<div class=\"wp-block-kadence-advancedbtn kb-buttons-wrap kb-btns27522_43a9fb-e5\"><a class=\"kb-button kt-button button kb-btn27522_dcaf50-18 kt-btn-size-standard kt-btn-width-type-auto kb-btn-global-fill  kt-btn-has-text-true kt-btn-has-svg-false  wp-block-kadence-singlebtn\" href=\"https://www.swiisfostercare.com/fostering/support/stability-and-support-team/\"><span class=\"kt-btn-inner-text\">View The Stability &amp; Support Team</span></a></div>\n\n\n\n<h2 class=\"wp-block-heading\">Looking Ahead to 2026</h2>\n\n\n\n<p>As we reflect on 2025, we do so with immense pride. This was a year of outstanding achievement, heartfelt dedication, and genuine transformation for children, foster carers, and staff alike.</p>\n\n\n\n<p>Together, we have shown what is possible when care, expertise, and passion come together. And as we look to the future, one thing remains certain: Swiis Foster Care will continue to go above and beyond, because every child deserves nothing less.</p>\n\n\n\n<p>As we move into 2026, our commitment remains unwavering. At Swiis Foster Care, we will continue to evolve and strengthen the support we provide to both our foster carers and the children and young people in their care. Everything we do is guided by one clear purpose: ensuring that every child can feel safe, nurtured, and supported to achieve their full potential.</p>\n\n\n\n<p>For those choosing to begin their fostering journey with Swiis, we are committed to making that experience as supportive, flexible, and stress-free as possible. From the very first conversation, through assessment, approval, and beyond, our focus is on supporting our carers every step of the way.</p>\n\n\n\n<p>During the next few months, we will be sharing more about the wonderful achievements of our children, celebrating their progress, resilience, and successes. We will also be highlighting the vital role of our social work teams and our foster carers, alongside the specialist provision offered by our Stability and Support Team, giving greater insight into how this enhanced support continues to make a meaningful difference for carers and children alike.</p>\n\n\n\n<p>In addition, we will be sharing more details about the feedback from our Ofsted Outstanding inspection outcomes, helping to demonstrate what outstanding practice looks like and how it directly benefits the children we support.</p>\n<p>The post <a href=\"https://www.swiisfostercare.com/swiis-foster-care-highlights-of-an-extraordinary-2025/\">Swiis Foster Care: Highlights of an Extraordinary 2025</a> appeared first on <a href=\"https://www.swiisfostercare.com\">Swiis Foster Care</a>.</p>",
      "images": [
        "https://www.swiisfostercare.com/wp-content/uploads/2026/01/FCE-Foster-Carer-Blogs-2-FCE-foster-carer-blogs-1200x600-Abbey.png"
      ]
    },
    {
      "id": "ours-website-news:8762ef5a",
      "sourceId": "ours-website-news",
      "sourceTitle": "Swiis Foster Care News",
      "company": "Swiis Foster Care",
      "companyGroup": "ours",
      "type": "website",
      "pageUrl": "https://www.swiisfostercare.com/info-hub/",
      "title": "What Are Empty Nesters and Why They Make Great Foster Carers",
      "link": "https://www.swiisfostercare.com/what-are-empty-nesters-and-why-they-make-great-foster-carers/",
      "isoDate": "2025-12-09T17:10:43.000Z",
      "snippet": "While having children is not a requirement for becoming a foster carer, the experience provides skills that are highly beneficial in caring for a young person. The post What Are Empty Nesters and Why They Make Great Foster Carers appeared first on Swiis Foster Care.",
      "content": "<p>As parents, we endeavour to raise children who are healthy, happy, and ready to take on the world. Watching them grow into confident young adults and eventually leave the family home is such a natural part of life, but when that day comes, it can stir up a whirlwind of emotions. After years of sharing laughter, teaching life skills, and helping them believe in themselves, the house suddenly feels a little quieter. It is a big change, and adjusting to this new chapter takes time.</p>\n\n\n\n<h2 class=\"wp-block-heading\">What Is an Empty Nester?</h2>\n\n\n\n<p>An empty nester is a parent whose children have moved out of the family home. Young adults leave for many reasons, such as attending university, starting a career, moving in with a partner, or simply beginning a new chapter in their lives.</p>\n\n\n\n<p>This transition brings a new lease of life for some parents, offering the freedom to try new things and explore new hobbies with their newly found time. However, for others, the change can be emotionally challenging.</p>\n\n\n\n<h2 class=\"wp-block-heading\">What Challenges Do Empty Nesters Face?</h2>\n\n\n\n<p>It is natural for empty nesters to experience feelings of loneliness or uncertainty as the house becomes quieter. The familiar routines that once shaped the day, washing uniforms, cooking meals, supervising homework, being a taxi driver or simply knowing that a child was home safe, are no longer there.</p>\n\n\n\n<p>Many parents find this shift surprisingly emotional. Often called ‘empty nester syndrome’, it can bring sadness, loneliness, and even a sense of grief. Missing the structure, the laughter, and the sense of purpose that once filled the day is common, and adjusting to a quieter home takes time.</p>\n\n\n\n<h2 class=\"wp-block-heading\">How Can Fostering Support Empty Nesters?</h2>\n\n\n\n<p>Even when children grow up and move out, the instinct to support, care for, and guide others often remains strong. Fostering offers a meaningful way to open both your heart and your home to a child or young person who needs stability, understanding and encouragement.</p>\n\n\n\n<p>Fostering is not about replacing grown children. Instead, it brings new purpose and an opportunity to make a meaningful difference in a young life. It allows parents to continue offering warmth, reassurance, and a sense of belonging to children and young people who need it most.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Why Empty Nesters Make Great Foster Carers</h2>\n\n\n\n<p>Empty nesters often make excellent foster carers for many reasons. Years of raising children provide valuable experience in navigating the challenges and milestones of childhood and adolescence. While having children is not a requirement for becoming a foster carer, this experience provides skills that are highly beneficial in caring for a young person.</p>\n\n\n\n<p>Empty nesters understand the daily responsibilities of parenting and preparing a child for independence in a safe and caring environment, which is the overall goal of fostering. Over the years, they also develop patience, effective communication, problem-solving skills, and emotional understanding, all of which are essential qualities for successful foster carers.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Thinking About Becoming a Foster Carer?</h2>\n\n\n\n<p>The home may feel quieter now, but this next chapter can be filled with connection, purpose, and the joy of making a lasting difference in a child or young person’s life.</p>\n\n\n\n<p>If you are thinking about becoming a foster carer or have any questions about how fostering can help fill your empty nest, <a href=\"https://www.swiisfostercare.com/contact/\">contact our recruitment team</a>, who can answer any questions you have and provide you with information on the excellent <a href=\"https://www.swiisfostercare.com/fostering/support/\">support</a>, <a href=\"https://www.swiisfostercare.com/fostering/training/\">training</a> and <a href=\"https://www.swiisfostercare.com/fostering/fostering-allowance-pay/\">allowance</a> Swiis offers.</p>\n<p>The post <a href=\"https://www.swiisfostercare.com/what-are-empty-nesters-and-why-they-make-great-foster-carers/\">What Are Empty Nesters and Why They Make Great Foster Carers</a> appeared first on <a href=\"https://www.swiisfostercare.com\">Swiis Foster Care</a>.</p>",
      "images": [
        "https://www.swiisfostercare.com/wp-content/uploads/2025/12/Empty-Nesters.jpg"
      ]
    },
    {
      "id": "ours-website-news:65ec8a7e",
      "sourceId": "ours-website-news",
      "sourceTitle": "Swiis Foster Care News",
      "company": "Swiis Foster Care",
      "companyGroup": "ours",
      "type": "website",
      "pageUrl": "https://www.swiisfostercare.com/info-hub/",
      "title": "Meet Gareth Thomas: Education Advisor",
      "link": "https://www.swiisfostercare.com/meet-gareth-thomas-education-advisor/",
      "isoDate": "2025-12-04T13:10:26.000Z",
      "snippet": "Gareth has worked for Swiis for 8 years and loves working with the children in foster care who need educational support. The post Meet Gareth Thomas: Education Advisor appeared first on Swiis Foster Care.",
      "content": "<p>The focus of our foster carers and the team around the foster carer is to care for and improve the lives of children and young people who are unable to stay with their birth parents. A huge part of a child’s everyday life is their education, which is critical for a child’s development. That is why at Swiis, we have dedicated Education Advisors to help provide extensive support to children and young people, ensuring that they have the best opportunities possible to achieve academic success.</p>\n\n\n\n<p>Meet Gareth Thomas, the person behind this important role! Gareth has worked for Swiis for 8 years and loves working with the children in foster care who need educational support.</p>\n\n\n\n<p>In his free time, Gareth loves travelling and embarking on long treks, which not only clears his mind but also allows him to discover new places and meet interesting people. He has a passion for cooking, rugby, exercise, and DIY projects &#8211; he even recently converted an old van into a campervan! A fun fact about Gareth is that he once taught young people how to drive on a race track at Castle Combe. His dream destinations are Vietnam and Thailand, where he looks forward to immersing himself in the vibrant culture and cuisine.</p>\n\n\n\n<p>Let us explore Gareth’s role as an Education Advisor, where he shares his insights on guiding foster children to unlock their full potential.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Your Role at Swiis Foster Care</strong></h2>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>What is your job title, and how long have you worked for Swiis?</strong></h3>\n\n\n\n<p><em>“I am the Education Advisor for Midlands and South, and I have been employed with Swiis for nearly 8 years.”</em></p>\n\n\n\n<p><em>“My role also allows me to support our placement support team in organising participation events and attending foster carer support groups to advise on how young people can be supported in their education.”</em></p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>What motivated you to work in foster care?</strong></h3>\n\n\n\n<p><em>“I wanted to learn how to support children and young people outside of their school environment, support foster families and help improve their lives inside and outside of school.”</em></p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>What does your role as an Education Advisor entail?</strong></h3>\n\n\n\n<p><em>“It is always evolving, however, my main responsibilities are to empower foster carers to support children’s education and outcomes and to ensure all children looked after within our care have the best opportunities to enable them to achieve good outcomes in their education, health and well-being.”</em></p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>What does a day in your role look like?</strong></h3>\n\n\n\n<p><em>“A normal day would include discussing issues and concerns that have been raised with other professionals in a multi-agency context, ensuring information to support young people is shared, and to monitor, record and update young people’s progress and to attend education meetings. I am also involved in the participation of events and activities throughout the year.”</em></p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Where does your department fit in the fostering process?</strong></h3>\n\n\n\n<p><em>“Once foster carers are approved, I contact them and offer advice and guidance on how children and young people can be supported in their education. This would include offering guidance concerning policy, children’s rights, school transitions and those young people transitioning to independence, such as university, work and other apprenticeships. Throughout the time the children are with our foster carers, I support and advocate for the children and foster carers.”</em></p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Fostering Insights</strong></h2>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>How do you help provide foster carers with the correct educational support at home?</strong></h3>\n\n\n\n<p><em>“Every child has a right to education, but some children who experience care, struggle in education for many reasons, including having to move to new areas on multiple occasions. This often means having to spend the first few days or weeks in the new foster home without education. My role would be to provide the foster carer with the appropriate resources to support the children’s learning, depending on their needs and abilities. Secondary to this, I would work with other agencies and schools to ensure that the most suitable school provision can be sourced, and the young person is given the opportunity to attend school at the earliest opportunity. As well as this being vital for their learning, it is also important for them to make friendships with their peers, appropriate adult relationships with adults and to give them social opportunities within their local community.”</em></p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>How does your role help to support the child in care and their foster carer?</strong></h3>\n\n\n\n<p><em>“I would normally introduce myself and explain my role to new foster carers so they are aware of how they can be supported with any educational issues or concerns. Types of support include training in how to advocate for their young people during PEP (Personal Education Plan) and EHCp (Education, Health Care Plan) meetings, advising of their rights and responsibilities, advising foster carers and young people in how to use and access resources that will enhance and support their learning.”</em></p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>What are some of the most memorable achievements you have seen from a child or young person?</strong></h3>\n\n\n\n<p><em>“Hearing the feedback from a young unaccompanied person who attended a university experience visit with the Swiis Midlands and South team. They informed me that the day would ‘stay with them forever’ and that it had inspired them to do well in their studies and attend a university in the future. The young person in question has since moved on to further education and is doing very well in his studies.</em></p>\n\n\n\n<p><em>“Another memorable experience was being with a group of foster children on a day visit to the Donkey Sanctuary and seeing them all play, laugh and eat ice cream together. They loved the day out. This type of event offers children the chance to interact with peers and adults in healthy, supportive environments, helping them learn social and life skills necessary for future independence.</em></p>\n\n\n\n<p><em>“Also, producing a Podcast with a young person who shared their thoughts and feelings on meaningful topics that affected their lives, such as bullying and identity. The young person felt extremely proud and hoped that it would help other young people. It is essential to provide foster children with a voice for their well-being and development, enabling them to express their emotions and thoughts. It also helps to shape decisions that impact their lives.”</em></p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>What do you think are the best qualities a foster carer should have?</strong></h3>\n\n\n\n<p><em>“The best qualities I think a foster carer should have in supporting young people are to show they are interested and invested in helping them with their well-being and safety by listening to them, showing them warmth, being inclusive of their needs and including them as part of the family. By appropriately advocating for their needs when communicating with health, education and social services will also show the young person they are being supported and listened to. The best qualities foster carers can possess are a combination of emotional, practical, and interpersonal abilities.”</em></p>\n\n\n\n<p>Gareth’s perspective on the educational <a href=\"https://www.swiisfostercare.com/fostering/support/\">support</a> offered by Swiis highlights our commitment to empowering foster children and young people to achieve academic success. By showcasing the teams and individuals who make Swiis exceptional, we aim to demonstrate our dedication to supporting foster children, young people and their foster carers every step of the way.</p>\n<p>The post <a href=\"https://www.swiisfostercare.com/meet-gareth-thomas-education-advisor/\">Meet Gareth Thomas: Education Advisor</a> appeared first on <a href=\"https://www.swiisfostercare.com\">Swiis Foster Care</a>.</p>",
      "images": [
        "https://www.swiisfostercare.com/wp-content/uploads/2025/12/Gareth-Thomas-Meet-The-Team-Blog.jpg"
      ]
    },
    {
      "id": "ours-website-news:c5880944",
      "sourceId": "ours-website-news",
      "sourceTitle": "Swiis Foster Care News",
      "company": "Swiis Foster Care",
      "companyGroup": "ours",
      "type": "website",
      "pageUrl": "https://www.swiisfostercare.com/info-hub/",
      "title": "Swiis Superstars Release Their First Music Track",
      "link": "https://www.swiisfostercare.com/swiis-superstars-release-their-first-music-track/",
      "isoDate": "2025-11-12T21:14:07.000Z",
      "snippet": "In our Yorkshire region, a group of musically talented individuals known as the Swiis Superstars have come together to create their very first original music track called ‘Our Moments’! The post Swiis Superstars Release Their First Music Track appeared first on Swiis Foster Care.",
      "content": "<p>The young people at Swiis Foster Care are filled with creativity and talent. In our <a href=\"https://www.swiisfostercare.com/locations/yorkshire/\">Yorkshire</a> region, a group of musically talented individuals known as the Swiis Superstars have come together to create their very first original music track called ‘Our Moments’!</p>\n\n\n\n<p>In the lead-up to their production day, the young people dedicated time to planning, collaborating, and bringing their ideas to life. The group decided that their song would focus on growing up in foster care, and each young person played an important part in the creative process.</p>\n\n\n\n<p>One young person, J, a talented lyricist and rapper, wrote the lyrics by drawing inspiration from his own experience in foster care. Alison, a Swiis Senior Placement Support Worker, said, <em>“The speed at which J was able to put the words together was incredible!”</em></p>\n\n\n\n<p>Once the lyrics were complete, R began experimenting with different sounds on a guitar to complement J’s words. After the group agreed on the perfect sound, E added in additional guitar tones, while P and S helped to create the beats, and PB added rhythm through their impressive beatboxing skills.</p>\n\n\n\n<p>One of the Swiis young people, G, also played a big part in creating the song and was eager to use their talent on the vocals. Unfortunately, they were not able to attend on production day, but we are really looking forward to hearing their musical talent in the future!</p>\n\n\n\n<p>When production day arrived, the Swiis local office was transformed into a lively recording studio, giving everyone the perfect space to come together and create their brand-new track.</p>\n\n\n\n<p>Once the song was complete, the group also wanted to create a cover for their track. They chose a dragon to symbolise courage, and one of our talented young people brought that vision to life by mocking up a design.</p>\n\n\n\n<p>We are incredibly proud of the Swiis Superstars for their teamwork and creativity throughout this project. They have such great passion and talent for music and have created a track to be proud of, and we are thrilled to share it with you!</p>\n\n\n\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"Our Moment - Swiis Superstars\" width=\"720\" height=\"405\" src=\"https://www.youtube.com/embed/Sx6aT5bKIOk?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div></figure>\n<p>The post <a href=\"https://www.swiisfostercare.com/swiis-superstars-release-their-first-music-track/\">Swiis Superstars Release Their First Music Track</a> appeared first on <a href=\"https://www.swiisfostercare.com\">Swiis Foster Care</a>.</p>",
      "images": [
        "https://www.swiisfostercare.com/wp-content/uploads/2025/11/swiis-superstars.jpg"
      ]
    },
    {
      "id": "ours-website-news:cf5fa88d",
      "sourceId": "ours-website-news",
      "sourceTitle": "Swiis Foster Care News",
      "company": "Swiis Foster Care",
      "companyGroup": "ours",
      "type": "website",
      "pageUrl": "https://www.swiisfostercare.com/info-hub/",
      "title": "Children of Foster Carers – Holly’s Story",
      "link": "https://www.swiisfostercare.com/children-of-foster-carers-hollys-story/",
      "isoDate": "2025-10-15T12:32:05.000Z",
      "snippet": "Holly’s parents began fostering with Swiis in 2010, and shortly after their approval, they welcomed a foster sibling group of two females and two males into their home. The post Children of Foster Carers – Holly’s Story appeared first on Swiis Foster Care.",
      "content": "<p>Children of foster carers play an essential role in the fostering household, and they contribute so much to the lives of the foster children and young people placed in their home. The patience, understanding and support that children of foster carers give to foster children and young people does not go unnoticed, and we are thankful for their dedication to helping transform the lives of others less fortunate.</p>\n\n\n\n<p>We had the opportunity to speak with Holly about her experience, who, along with&nbsp;her older brother, grew up as a child of foster carers. Holly’s parents began fostering with Swiis in 2010, and shortly after their approval, they welcomed a foster sibling group of two females and two males into their home. With the foster children ranging in age from infancy to six years old, Holly, who was just nine at the time, quickly went from being the youngest in her family to having four younger foster children in the home.</p>\n\n\n\n<p>She recalls her dad introduced the idea of becoming a foster carer, and because her grandmother had been fostering for years, Holly already understood what it meant to welcome children in need into her home.</p>\n\n\n\n<blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\">\n<p><em>“I remember being really excited about it and excited for my dad’s new career path.”</em></p>\n</blockquote>\n\n\n\n<p>Holly shared with us some of her favourite earliest memories with the foster children.</p>\n\n\n\n<blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\">\n<p><em> “The female foster children and I all used to love it when I would do their makeup and paint their nails when we were younger. I take pride in knowing that they have always looked up to me and I’ve loved watching them grow up into beautiful, strong, and kind young women.”</em></p>\n</blockquote>\n\n\n\n<p>Over the years, Holly has been amazed at&nbsp;watching each of the foster children in the home grow and thrive. She has seen the youngest foster boys adapt to the challenges of high school and overcome any social difficulties.</p>\n\n\n\n<blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\">\n<p><em>“I’ve loved seeing the youngest boys grow up and mature, and love that the youngest often wants to spend time with me just to chat about his day and ask me about my life. The two female foster children are at that age now where we can talk like friends as well as sisters, and I love being able to talk and gossip about girl stuff and have fun with them outside of ‘older sibling duties’!”</em></p>\n</blockquote>\n\n\n\n<p>As Holly became no longer the youngest in her family, it meant that there was a shift in the role she played in the household, she stepped up, taking on more responsibilities.</p>\n\n\n\n<blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\">\n<p><em>“I feel like I took on a lot of responsibilities from a younger age as I felt a bond early on and wanted to help care for them the best I could. The last few years I’ve occasionally helped my parents with babysitting when they want to go out for dinner or enjoy a holiday away, or even small moments when they want to go out for a walk. I’ve always tried to help where I can in looking after them.”</em></p>\n</blockquote>\n\n\n\n<p>Individuals like Holly leave a lasting impact on the lives of foster children and young people. She has played a significant role in creating a safe, stable, and loving environment by being a trusted and caring role model for them. Her dedication is a reminder of how the entire family plays a crucial part in the fostering experience, making a meaningful difference in the lives of those they welcome into their home.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Thinking about fostering?</h2>\n\n\n\n<p>If you’re considering fostering and want to learn more about how Swiis can support both you and your children throughout the journey, <a href=\"https://www.swiisfostercare.com/contact/\">contact our recruitment team</a> who can answer any questions you might have.</p>\n<p>The post <a href=\"https://www.swiisfostercare.com/children-of-foster-carers-hollys-story/\">Children of Foster Carers – Holly’s Story</a> appeared first on <a href=\"https://www.swiisfostercare.com\">Swiis Foster Care</a>.</p>",
      "images": [
        "https://www.swiisfostercare.com/wp-content/uploads/2025/10/FCE-Foster-Carer-Blogs-Holly.jpg"
      ]
    },
    {
      "id": "ours-website-news:9e84064a",
      "sourceId": "ours-website-news",
      "sourceTitle": "Swiis Foster Care News",
      "company": "Swiis Foster Care",
      "companyGroup": "ours",
      "type": "website",
      "pageUrl": "https://www.swiisfostercare.com/info-hub/",
      "title": "Children of Foster Carers’ Week",
      "link": "https://www.swiisfostercare.com/children-of-foster-carers-week/",
      "isoDate": "2025-10-07T15:15:21.000Z",
      "snippet": "Children of Foster Carers' Week is taking place from 13th to 19th October 2025. The post Children of Foster Carers’ Week appeared first on Swiis Foster Care.",
      "content": "<p>Children of Foster Carers’ Week is an annual campaign organised by <a href=\"https://www.thefosteringnetwork.org.uk/about-fostering/for-fostering-services/recruitment-and-retention/children-of-foster-carers-month/\">The Fostering Network</a>, taking place from 13th to 19th October 2025. The week was created to recognise and celebrate the incredible role that the children of foster carers play within a fostering household.</p>\n\n\n\n<p>Whether a foster carer’s child is young, a teenager, or has grown up and moved out of the family home, the children of foster carers often provide support to both their parents and the foster child or young person. Some responsibilities they have can include:</p>\n\n\n\n<ul class=\"wp-block-list\">\n<li>Being a positive role model for the child or young person</li>\n\n\n\n<li>Supporting with everyday tasks, such as school pick-ups or cooking</li>\n\n\n\n<li>Sharing personal things like toys, books, or games</li>\n\n\n\n<li>Helping them learn about responsibilities within the home</li>\n\n\n\n<li>Offering a listening ear and someone they can talk to</li>\n</ul>\n\n\n\n<p>Throughout the week, we will be sharing case studies from children of foster carers to highlight their experiences and the vital role they play in the fostering household. These stories highlight how fostering has impacted their life and the amazing memories they have had watching foster children and young people develop over their time together.</p>\n\n\n\n<p>To kick start Children of Foster Carers week, we spoke to Lockie and Pippa, who shared what their favourite memory with a foster child or young person has been so far, what they enjoy most about being part of a fostering household, how their responsibilities may have changed over time, and any additional thoughts they wanted to share.</p>\n\n\n\n<hr class=\"wp-block-separator has-alpha-channel-opacity\"/>\n\n\n\n<h2 class=\"wp-block-heading\">Lockie – Aged 9</h2>\n\n\n\n<p><strong>What has been your most memorable or special experience with a foster child?</strong></p>\n\n\n\n<p><em>“When we all went to Disneyland at Christmas. It was good having L to go on all the rides with, especially the bigger ones, because my sisters don’t like them. We like the Spider-Man ride the most, shooting webs with our hands and wearing the 3D glasses.”</em></p>\n\n\n\n<p><strong>What do you enjoy most about having a foster child in your home?</strong></p>\n\n\n\n<p><em>“L plays football with me in the garden and plays Roblox with me on the Xbox. He’s getting better at playing with me, and it’s good having a boy to play outside with at football.”</em></p>\n\n\n\n<p><strong><em>Have your responsibilities at home changed since your family began fostering? If so, how?</em></strong></p>\n\n\n\n<p><em>“I help him and remind him how to be good, especially because my little sister copies, and we need to teach her to be kind.”</em></p>\n\n\n\n<hr class=\"wp-block-separator has-alpha-channel-opacity\"/>\n\n\n\n<h2 class=\"wp-block-heading\">Pippa – Aged 15</h2>\n\n\n\n<p><strong>What has been your most memorable or special experience with a foster child?</strong></p>\n\n\n\n<p>“I have had lots of lovely memories of past and present little ones, building special bonds that last a lifetime, Christmases full of excitement and magic.</p>\n\n\n\n<p>“Times when I come home from school to be greeted with 2 little ones chanting my name as I walk through the door, both wanting big hugs.”</p>\n\n\n\n<p><strong>What do you enjoy most about having a foster child in your home?</strong></p>\n\n\n\n<p><em>“Fun and laughter everywhere, to stay with me forever.”</em></p>\n\n\n\n<p><strong><em>Have your responsibilities at home changed since your family began fostering? If so, how?</em></strong></p>\n\n\n\n<p><em>“They have stayed the same even though things have changed. I enjoy playing with toys and reading stories.”</em></p>\n\n\n\n<p><strong>Is there anything else you would like to share about your experiences?</strong></p>\n\n\n\n<p><em>“I have found it to be really positive having my parents be able to foster, even though it does have its sad times, like when they move on to adoption.”</em></p>\n\n\n\n<hr class=\"wp-block-separator has-alpha-channel-opacity\"/>\n\n\n\n<p></p>\n\n\n\n<p>To view more case studies from Children of Foster Carers, take a look at our <a href=\"https://www.swiisfostercare.com/info-hub/\">Info Hub</a>.</p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Thinking about becoming a foster carer?</strong></h2>\n\n\n\n<p>If you are interested in learning more about becoming a foster carer,&nbsp;<a href=\"https://www.swiisfostercare.com/contact/\">get in touch with our recruitment team,</a>&nbsp;who can answer any questions you have about fostering and provide you with information on the excellent&nbsp;<a href=\"https://www.swiisfostercare.com/fostering/support/\">support</a>,&nbsp;<a href=\"https://www.swiisfostercare.com/fostering/training/\">training</a>&nbsp;and&nbsp;<a href=\"https://www.swiisfostercare.com/fostering/fostering-allowance-pay/\">allowance</a>&nbsp;Swiis offers.</p>\n<p>The post <a href=\"https://www.swiisfostercare.com/children-of-foster-carers-week/\">Children of Foster Carers’ Week</a> appeared first on <a href=\"https://www.swiisfostercare.com\">Swiis Foster Care</a>.</p>",
      "images": [
        "https://www.swiisfostercare.com/wp-content/uploads/2025/10/Children-of-Foster-Carers-Week.jpg"
      ]
    },
    {
      "id": "ours-website-news:3b1902ec",
      "sourceId": "ours-website-news",
      "sourceTitle": "Swiis Foster Care News",
      "company": "Swiis Foster Care",
      "companyGroup": "ours",
      "type": "website",
      "pageUrl": "https://www.swiisfostercare.com/info-hub/",
      "title": "Children of Foster Carers – Summer’s Story",
      "link": "https://www.swiisfostercare.com/children-of-foster-carers-summers-story/",
      "isoDate": "2025-10-02T08:30:27.000Z",
      "snippet": "Swiis welcomes foster carers from all walks of life, including those who already have children of their own. For some families, this means their child has spent most of their life as an only child, until the family decides to welcome foster children into their home. The post Children of Foster Carers – Summer’s Story appeared first on Swiis Foster Care.",
      "content": "<p>Swiis welcomes foster carers from all walks of life, including those who already have children of their own. For some families, this means their child has spent most of their life as an only child, until the family decides to welcome foster children into their home.</p>\n\n\n\n<p>This was the case for Summer, who grew up as an only child for 13 years before her parents began fostering two girls, aged 1 and 12 at the time. While the transition from being an only child to suddenly having other children in the household can be a big adjustment, Summer embraced the change and quickly thrived in her new role as the oldest child in the family.</p>\n\n\n\n<p>Like any change in routine, fostering comes with challenges that the whole family must navigate. But for Summer, the rewards far outweigh the difficulties.&nbsp;</p>\n\n\n\n<blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\">\n<p><em>“I have a few things that I enjoy about us being a foster family. I love that there is always someone to spend time with and chat with. I also really like that when we became a foster family, Dad started spending more time at home because he left his old job, and now I get to see both Mum and Dad all the time, which is really nice.</em></p>\n\n\n\n<p><em>“I like that we are a bigger family now. When our house and my Auntie’s house get together, there are over ten of us. We used to just be three, but now we are five, and I really like that.</em></p>\n\n\n\n<p><em>“I also like that we all share things and help each other. For example, J played with my rabbit, Princess, last week, and while she was with her, she cleaned her out, which I was really happy about because that’s usually my job. In return, I helped J organise her wardrobe. We just do everything together.”</em></p>\n</blockquote>\n\n\n\n<p>Over the past couple of years, Summer’s relationship with the foster children has blossomed, and together they have already created so many memorable experiences.</p>\n\n\n\n<blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\">\n<p><em>“My favourite thing we have experienced together is our holiday. We have had so many amazing times, but without a doubt, going to the Caribbean as a family was my favourite. The things I took for granted on holiday, they were just so excited about, and I really enjoyed sharing those moments with them. Plus, every time we wanted to play in the pool, there was always someone to play with.</em></p>\n\n\n\n<p><em>“Things like the plane ride stood out to me. I moaned about being on the plane for 9 hours, but they were so excited and grateful for just getting the opportunity to go on the plane.</em></p>\n\n\n\n<p><em>“We also went zip-lining through the Caribbean Lake Park, which was really special. That is one of my favourite memories ever.”</em></p>\n</blockquote>\n\n\n\n<p>As Summer’s relationships with the children have grown, her role within the household has changed, and she has taken on more responsibilities as the oldest child.&nbsp;</p>\n\n\n\n<blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\">\n<p><em>“It’s great how my responsibilities have changed! I used to have the jobs of dishwasher and recycling, but now J does the dishwasher, and I do the recycling, so we have split the jobs, which is good because I didn’t like the dishwasher, but J doesn’t mind it.</em></p>\n\n\n\n<p><em>“I am the oldest now, so I do older sister stuff, like reminding P to put her coat on and trying to teach her how to fasten her shoelaces. I also taught J how to straighten and curl her hair.”</em></p>\n</blockquote>\n\n\n\n<p>As Summer has taken on new responsibilities at home, she has also had time to reflect on how fostering has shaped her life and how it might influence her future. When asked if there was anything else she would like to share about her experiences, Summer said:</p>\n\n\n\n<blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\">\n<p><em>“Fostering has been in my life since I was really young. I was 6 or 7 when Auntie started, and then 12 when Mum and Dad started, so I am pretty used to the fostering world now. Since we started fostering, we have had really good days, but also some really difficult days. Everyone tells us ‘It’s a journey’, but that’s because it actually is.</em></p>\n\n\n\n<p><em>“I’m really happy with where we are now though, life’s normal for us. I feel really proud that we foster, and I have even started thinking about becoming a foster carer myself when I’m older. I’m going to finish Uni and get my degree, but I really do think I will take a similar path and foster. I want to foster teens. Seeing how J opened up to me when we chatted, I think I’d be good with teens.”</em></p>\n</blockquote>\n\n\n\n<p>Summer’s inspiring story of growing up as the child of foster carers highlights the incredible experiences and memories that fostering has given her, as well as how it has influenced her future. Fostering can be a life-changing experience for everyone involved, not just the children and young people in care, but for the entire family.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Thinking about becoming a foster carer?</h2>\n\n\n\n<p>If you are interested in learning more about becoming a foster carer,&nbsp;<a href=\"https://www.swiisfostercare.com/contact/\">get in touch with our recruitment team,</a>&nbsp;who can answer any questions you have about fostering and provide you with information on the excellent&nbsp;<a href=\"https://www.swiisfostercare.com/fostering/support/\">support</a>,&nbsp;<a href=\"https://www.swiisfostercare.com/fostering/training/\">training</a>&nbsp;and&nbsp;<a href=\"https://www.swiisfostercare.com/fostering/fostering-allowance-pay/\">allowance</a>&nbsp;Swiis offers.</p>\n<p>The post <a href=\"https://www.swiisfostercare.com/children-of-foster-carers-summers-story/\">Children of Foster Carers &#8211; Summer’s Story </a> appeared first on <a href=\"https://www.swiisfostercare.com\">Swiis Foster Care</a>.</p>",
      "images": [
        "https://www.swiisfostercare.com/wp-content/uploads/2025/10/foster-carer-story-summer.jpg"
      ]
    },
    {
      "id": "ours-website-news:bc1124ce",
      "sourceId": "ours-website-news",
      "sourceTitle": "Swiis Foster Care News",
      "company": "Swiis Foster Care",
      "companyGroup": "ours",
      "type": "website",
      "pageUrl": "https://www.swiisfostercare.com/info-hub/",
      "title": "Children of Foster Carers – Harmeet’s Story",
      "link": "https://www.swiisfostercare.com/children-of-foster-carers-harmeets-story/",
      "isoDate": "2025-10-01T08:24:41.000Z",
      "snippet": "When a family begins their fostering journey, it does not just impact the foster carers themselves, it affects everyone connected to the household, including their children. The post Children of Foster Carers – Harmeet’s Story appeared first on Swiis Foster Care.",
      "content": "<p>When a family begins their fostering journey, it does not just impact the foster carers themselves, it affects everyone connected to the household, including their children. For many children of foster carers, it means learning to share their home, toys and even their parents&#8217; time, but for those older children who are now adults no longer living at home, fostering impacts them differently.</p>\n\n\n\n<p>This has been the case for Harmeet, as when her parents decided to foster, she was no longer living in the family household, but she still experienced the rewards of fostering and found ways to support her parents and the children in their care.</p>\n\n\n\n<blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\">\n<p><em>“Seeing a foster child feeling safe and happy at home is rewarding because we are able to work together and provide a stable and caring environment. Even though I don’t live at home, I support my parents by helping care for the children when they are away for the day. It’s meaningful to be part of that support system and contribute in any way I can.”</em></p>\n</blockquote>\n\n\n\n<p>Fostering brings many new responsibilities, and it is not only the foster carers themselves who have a change in responsibility, but also everyone close to them who plays a part in supporting the journey. For Harmeet, she has played a massive part in supporting her parents with the children and young people they foster, and it has taught her valuable emotional and interpersonal skills.</p>\n\n\n\n<blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\">\n<p><em>“My responsibilities have changed since my parents began fostering. Even though I no longer live at home, I now help more with caring for the foster children when I visit or when my parents are out for the day.</em></p>\n\n\n\n<p><em>“I might play with them, help with meals, or just keep them company so they feel safe and supported. It has taught me the importance of consistency and patience, and I feel proud to be part of something that really makes a difference.”</em></p>\n</blockquote>\n\n\n\n<p>Over the years that Harmeet’s parents have fostered, she has built many wonderful memories with the children and young people who have joined their family. Each new arrival has brought new experiences, and Harmeet continues to form special bonds with all the children her parents look after, making a lasting impact on her.</p>\n\n\n\n<blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\">\n<p><em>“One of the most memorable experiences I had was with a foster child who came into our home at the age of 3. From the beginning, we built a strong and positive bond. I enjoyed getting her small toys and gifts, which always brought her joy. Although I no longer see her in person as often, we stay connected through regular video calls. She lights up with excitement every time we talk, and seeing that joy reminds me how meaningful even the smallest connections can be in a child’s life.”</em></p>\n</blockquote>\n\n\n\n<p>Harmeet’s story highlights that even when a child of foster carers is an adult and no longer living in the family home, they can still be deeply impacted by the rewarding experiences that fostering brings. It has given Harmeet a new perspective on responsibility and shown her just how meaningful fostering can be in a child or young person’s life.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Thinking about becoming a foster carer?</h2>\n\n\n\n<p>If you are interested in learning more about becoming a foster carer,&nbsp;<a href=\"https://www.swiisfostercare.com/contact/\">get in touch with our recruitment team,</a>&nbsp;who can answer any questions you have about fostering and provide you with information on the excellent&nbsp;<a href=\"https://www.swiisfostercare.com/fostering/support/\">support</a>,&nbsp;<a href=\"https://www.swiisfostercare.com/fostering/training/\">training</a>&nbsp;and&nbsp;<a href=\"https://www.swiisfostercare.com/fostering/fostering-allowance-pay/\">allowance</a>&nbsp;Swiis offers.</p>\n<p>The post <a href=\"https://www.swiisfostercare.com/children-of-foster-carers-harmeets-story/\">Children of Foster Carers &#8211; Harmeet&#8217;s Story</a> appeared first on <a href=\"https://www.swiisfostercare.com\">Swiis Foster Care</a>.</p>",
      "images": [
        "https://www.swiisfostercare.com/wp-content/uploads/2025/10/foster-carer-story-harmeet.jpg"
      ]
    },
    {
      "id": "ours-website-news:33cc4b04",
      "sourceId": "ours-website-news",
      "sourceTitle": "Swiis Foster Care News",
      "company": "Swiis Foster Care",
      "companyGroup": "ours",
      "type": "website",
      "pageUrl": "https://www.swiisfostercare.com/info-hub/",
      "title": "Children of Foster Carers – Rachel’s Story",
      "link": "https://www.swiisfostercare.com/children-of-foster-carers-rachels-story/",
      "isoDate": "2025-09-30T14:24:00.000Z",
      "snippet": "Being a child of a foster carer can open a world of new experiences and shape your life in ways you might never expect. The post Children of Foster Carers – Rachel’s Story appeared first on Swiis Foster Care.",
      "content": "<p>Being a child of a foster carer can open a world of new experiences and shape your life in ways you might never expect. For Rachel, this allowed her to witness firsthand the impact that care, support, and guidance can have on a child’s life. Rachel&#8217;s mother&#8217;s decision to foster not only shaped the dynamics of their family but also inspired Rachel’s own path in life, leading her to become a foster carer herself.</p>\n\n\n\n<p>Rachel has always believed that the rewards of welcoming foster children into her household far outweigh any challenges. For her, the addition of foster children and young people felt natural, and a lot of her daily life remained the same.</p>\n\n\n\n<blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\">\n<p><em>“Having foster children was great, it was like inviting our ‘bonus family’ into our home. We extended our family to those who need it most and seeing them grow and progress into young adults is one of the most rewarding things I have experienced.</em></p>\n\n\n\n<p><em>“I also don’t feel anything changed when we gained our bonus family. We made sure they felt safe and secure, but we lived our lives as normal with our new additions.”</em></p>\n</blockquote>\n\n\n\n<p>During the years of being a child of a foster carer, Rachel was part of countless special memories that ranged from small, everyday moments to life-changing events. From playful afternoons in the garden to the celebrations of important milestones, these experiences left a lasting impression on her.</p>\n\n\n\n<blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\">\n<p><em>“Over the time that my mother was a foster carer, we had many memorable experiences, so it&#8217;s hard to choose one! I remember setting up a water slide in our garden on a summer&#8217;s day, which ended up in a big water fight with lots of laughs! We have shared memories on holidays, life celebrations, and milestones. One of the biggest highlights was when we had the honour of reuniting a child with her mother after around 10 years of separation. It brought tears to everyone’s eyes. What an amazing moment to be a part of!”</em></p>\n</blockquote>\n\n\n\n<p>The impact of fostering as a child of a foster carer stayed with Rachel, and today she has followed in her mother’s footsteps, becoming a foster carer herself, which Rachel would encourage all to try if they can.</p>\n\n\n\n<blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\">\n<p><em>“I would like to add that if anyone is considering fostering but unsure due to their birth children, in my experience, it added a level of gratitude, empathy, and love that I wouldn’t have experienced if my mother didn’t foster. Seeing those children grow to the amazing individuals they are today encouraged me to become a foster carer myself. I have now been doing this for almost three years, and I’ve enjoyed it from day one.</em></p>\n\n\n\n<p><em>“Give it a go and change some lives!”</em></p>\n</blockquote>\n\n\n\n<p>To read more about Rachel and her mother, Vicky’s fostering journey, you can read their story <a href=\"https://www.swiisfostercare.com/story/vicky-and-rachels-fostering-story/\">here</a>.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Thinking about becoming a foster carer?</h2>\n\n\n\n<p>If you are interested in learning more about becoming a foster carer,&nbsp;<a href=\"https://www.swiisfostercare.com/contact/\">get in touch with our recruitment team,</a>&nbsp;who can answer any questions you have about fostering and provide you with information on the excellent&nbsp;<a href=\"https://www.swiisfostercare.com/fostering/support/\">support</a>,&nbsp;<a href=\"https://www.swiisfostercare.com/fostering/training/\">training</a>&nbsp;and&nbsp;<a href=\"https://www.swiisfostercare.com/fostering/fostering-allowance-pay/\">allowance</a>&nbsp;Swiis offers.</p>\n<p>The post <a href=\"https://www.swiisfostercare.com/children-of-foster-carers-rachels-story/\">Children of Foster Carers – Rachel’s Story</a> appeared first on <a href=\"https://www.swiisfostercare.com\">Swiis Foster Care</a>.</p>",
      "images": [
        "https://www.swiisfostercare.com/wp-content/uploads/2025/10/foster-carer-story-rachel.jpg"
      ]
    },
    {
      "id": "ours-website-news:4f6204ba",
      "sourceId": "ours-website-news",
      "sourceTitle": "Swiis Foster Care News",
      "company": "Swiis Foster Care",
      "companyGroup": "ours",
      "type": "website",
      "pageUrl": "https://www.swiisfostercare.com/info-hub/",
      "title": "Why I Want to Stay with My Foster Carers",
      "link": "https://www.swiisfostercare.com/why-i-want-to-stay-with-my-foster-carers/",
      "isoDate": "2025-09-11T14:17:44.000Z",
      "snippet": "Recently, a young person placed with Swiis Foster Carers, had the opportunity to share her wishes with the court. She wrote a touching letter about her current experience in foster care with her siblings and explained why she hopes she and her siblings remain long-term with their carers. The post Why I Want to Stay with My Foster Carers appeared first on Swiis Foster Care.",
      "content": "<p>When a child or young person comes into the care of the local authority, they are placed into a temporary home, which may be with foster carers in a short or long-term home-finding arrangement.</p>\n\n\n\n<p>Recently, a young person placed with Swiis Foster Carers, had the opportunity to share her wishes with the court. She wrote a touching letter about her current experience in foster care with her siblings and explained why she hopes she and her siblings remain long-term with their carers.</p>\n\n\n\n<p>This young person would like to selflessly share her letter with the hope that it will inspire others and show the incredible difference fostering can make in the life of a child or young person.</p>\n\n\n\n<p><em>Names have been changed to protect the identity of the young person and foster carers.&nbsp;</em></p>\n\n\n\n<hr class=\"wp-block-separator has-alpha-channel-opacity\"/>\n\n\n\n<p>“Sarah and David are quite literally some of the sweetest people I have ever met. They have always been so caring and supportive since the very first day we arrived, and I have felt like I have already gotten more care and support from them in just a few months than I ever got with my mam in 15 years. </p>\n\n\n\n<p>I wasn’t very keen on them at the start as I felt like I didn’t fit in. They are social and I wasn’t, they liked going out to places, and I preferred staying at home. And I guess I wasn’t really used to the environment of a nice home and family dinners and showers/baths every night.</p>\n\n\n\n<p>My first night, I cried loads. I missed my bed, and I felt like I made a very awful decision. But they made me feel so welcome. The first day, I had a nice relaxing bath, they gave me my space and let us get what we wanted for tea. And honestly, nothing has really changed since that day other than that we are more comfortable around each other, and I am so much happier now that I got the chance to be with such lovely people.</p>\n\n\n\n<p>Ever since the first day, they have always been there for me, no matter what. They are always so caring and helpful. They are so supportive of everything I do. Every time I am upset, they always notice, and they are right on track to figure out what is wrong and try their best to help with the situation. And of course, if I want or need any space, they will respectfully give me some.</p>\n\n\n\n<p>It’s not just them, the whole family are the most welcoming, caring and loving people anyone could ever ask for, and I feel like I warmed up to everyone quite fast. Living with them all has made me a better person.&nbsp;&nbsp;</p>\n\n\n\n<p>My mental health overall has been so much better than it was while I was with my mam. I have a healthier diet. Sarah and David make sure we are getting proper, nutritious food, instead of fries and chicken nuggets all the time. They also make sure everyone is okay with having that food for tea, and if someone isn’t, then normally small adjustments will be made. For example, when they make Curry, we aren’t that big on spice, so they make us a non-spicy “curry”. (By “we”, I am referring to me and my brothers).&nbsp;</p>\n\n\n\n<p>They always buy us things that we need, even if we don’t ask them to. Like one day it can just be brought up in a conversation, then a few days later it arrives. Obviously, they are responsible and try to teach us the value of money, so they don’t just buy us anything we want. If we want something that’s quite pricey or just a silly little thing, then we save up for it. If it is school related, or something crafty, just anything that would get us away from devices, or if its hygiene related, then they will buy it for us.</p>\n\n\n\n<p>They are quite chill and relaxed and don’t let things people say bother them. They are constantly reminding me that people will just say things out of jealousy or boredom and that I should just ignore what people think or say about me. If they want to do that, then they can go ahead and do it. Why should it be my issue, I know I&#8217;m a good person.</p>\n\n\n\n<p>Whenever I am stressed, they always try their best to help me out as much as they possibly can. There was a moment when I was constantly stressed in school, and it would cause me to scratch my skin. Sarah wasted no time getting me a fidget ring and bracelet to distract me, and she would give me some cream for my wounds.</p>\n\n\n\n<p>Honestly, I have been such a better, happier and healthier person since living with them, and they have impacted my life in an amazing way. Even people at school have been saying that I look so much better than I used to.</p>\n\n\n\n<p>I also have become a slightly more sociable, confident and productive person and I feel like I get more things done now. And I socialise with people a bit more since we are always going out. I have become more confident with myself, I used to be so insecure and now I don’t let that bother me as much. I’ve even been doing more and better at subjects in school because I don’t have as much stress as I used to when living with my mam. I have been able to hand in my homework on time, get a lot of work done in lessons, and revise properly.&nbsp;&nbsp;</p>\n\n\n\n<p>They are the reason I am the person I am today.&nbsp;&nbsp;</p>\n\n\n\n<p>I feel like they would have an amazing impact on my future. I will actually have people to talk to about things like what to do when leaving school, how to find a job, how to deal with all sorts of payments, getting a house, college, and university. Just overall, how to be a good person.&nbsp;&nbsp;</p>\n\n\n\n<p>I feel like I will actually have someone to help me through any hard times I have, someone I can actually talk to about things. I am no longer afraid of growing up, because I know that I am surrounded by amazing people who will support me and be there for me through thick and thin.&nbsp;</p>\n\n\n\n<p>When I lived with my mam, I was constantly afraid of growing up. I wanted to be dead by the age of 16 just so that I didn’t need to live a life like my mams.&nbsp;</p>\n\n\n\n<p>Sarah and David have given me and my brothers such a safe environment to be in. They have given us the opportunities to experience different things and to explore more things, to figure out what we enjoy doing and what we don’t enjoy doing. They don’t let us give up, but they don’t force us either. They just give us a slight nudge to get us started, then let us continue the rest.&nbsp;&nbsp;</p>\n\n\n\n<p>They have made my life so much better in such a small amount of time, and I will forever be grateful to them and their whole family. I will always be grateful for everything they have done for us.&nbsp;&nbsp;</p>\n\n\n\n<p>Thank you so much for taking the time out of your day to read my letter. I really appreciate the chance to share a part of my story with you.&nbsp;&nbsp;</p>\n\n\n\n<p>Have an amazing day.</p>\n\n\n\n<p>Sincerely – N”</p>\n\n\n\n<hr class=\"wp-block-separator has-alpha-channel-opacity\"/>\n\n\n\n<h2 class=\"wp-block-heading\">Has this letter inspired you to become a foster carer?</h2>\n\n\n\n<p>N has beautifully shown within this letter how much of an impact becoming a foster carer can have on a child or young person&#8217;s life. If this letter has inspired you to consider fostering and you would like to learn more, please <a href=\"https://www.swiisfostercare.com/contact/\">contact our recruitment team</a>. They will be happy to answer your questions and share details about the <a href=\"https://www.swiisfostercare.com/fostering/support/\">support</a> and <a href=\"https://www.swiisfostercare.com/fostering/fostering-allowance-pay/\">fostering allowance</a> Swiis offers.</p>\n<p>The post <a href=\"https://www.swiisfostercare.com/why-i-want-to-stay-with-my-foster-carers/\">Why I Want to Stay with My Foster Carers</a> appeared first on <a href=\"https://www.swiisfostercare.com\">Swiis Foster Care</a>.</p>",
      "images": [
        "https://www.swiisfostercare.com/wp-content/uploads/2025/09/person-reading-a-letter.jpg"
      ]
    },
    {
      "id": "ours-website-news:d37b948b",
      "sourceId": "ours-website-news",
      "sourceTitle": "Swiis Foster Care News",
      "company": "Swiis Foster Care",
      "companyGroup": "ours",
      "type": "website",
      "pageUrl": "https://www.swiisfostercare.com/info-hub/",
      "title": "Can Foster Children Share a Bedroom?",
      "link": "https://www.swiisfostercare.com/can-foster-children-share-a-bedroom/",
      "isoDate": "2025-08-22T12:49:14.000Z",
      "snippet": "'Children in care' over the age of 3 years old must have their own room. The post Can Foster Children Share a Bedroom? appeared first on Swiis Foster Care.",
      "content": "<p>&#8216;Children in care&#8217; over the age of 3 years old must have their own room. It may be possible for siblings to share a room if they are of the same gender, of an appropriate age, and it has been decided by the local authority responsible for children that this is agreeable. The Local Authority will assess each situation to determine if sharing a room is in the child’s best interest.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Why Would Foster Siblings Not Share a Bedroom?</h2>\n\n\n\n<p>While some <a href=\"https://www.swiisfostercare.com/fostering/types-of-fostering/sibling-fostering/\">foster siblings</a> may have a close relationship, sharing a bedroom is not always the best option due to the complex emotions children often experience. Many children in foster care have undergone trauma, whether from experiences with their birth parents or the stress of being separated from them. In some cases, these past experiences can strain sibling relationships, even leading to conflict or bullying. In some situations, sharing a room can provide comfort and security, while in others, it may harm the child&#8217;s well-being. Therefore, the decision for siblings to share a room should be made on a case-by-case basis to ensure the arrangement benefits each of the foster children.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Why Does a Foster Child Need Their Own Bedroom?</h2>\n\n\n\n<p>A foster child needs their own bedroom as it is considered a safe space for them. One of the main reasons children enter foster care is due to abuse and neglect from their birth parents. Having a space to call their own gives them the privacy and sense of security they need and deserve. It also allows them to have a quiet area where they can read, play or do their homework. This is especially important in a fostering household with more than one child in it, as it can often be overwhelming to some, so a peaceful place that they can call their own is essential.</p>\n\n\n\n<h2 class=\"wp-block-heading\">Do You Have a Spare Bedroom and Want to Make a Difference in a Child’s Life?</h2>\n\n\n\n<p>If you are considering becoming a foster carer and meet the requirements, such as having a <a href=\"https://www.swiisfostercare.com/do-i-need-a-spare-room-to-foster/\">spare bedroom</a>, being over 21 years old, holding British citizenship or indefinite leave to remain, and being medically fit to work, then contact our <a href=\"https://www.swiisfostercare.com/contact/\">recruitment team</a>. We will answer any questions and help you take the first steps toward your fostering career.</p>\n\n\n\n<p>Swiis provides foster carers with the highest levels of <a href=\"https://www.swiisfostercare.com/fostering/support/\">support</a>, <a href=\"https://www.swiisfostercare.com/fostering/training/\">training</a> and <a href=\"https://www.swiisfostercare.com/fostering/fostering-allowance-pay/\">financial allowance</a>.&nbsp; This enables our foster carers to give the children in their care the support and care they need to be supported and thrive.</p>\n<p>The post <a href=\"https://www.swiisfostercare.com/can-foster-children-share-a-bedroom/\">Can Foster Children Share a Bedroom? </a> appeared first on <a href=\"https://www.swiisfostercare.com\">Swiis Foster Care</a>.</p>",
      "images": [
        "https://www.swiisfostercare.com/wp-content/uploads/2025/08/pexels-taryn-elliott-4440220.jpg"
      ]
    }
  ]
}